package bitset_search

import (
	"strings"
	"unicode"

	"github.com/kljensen/snowball/russian"
)

func parseKeywords(s string, ignoreStopWords bool) []string {
	rawKeywords := strings.Split(strings.ToLower(s), " ")
	keywords := make([]string, 0, len(rawKeywords))

	for _, keyword := range rawKeywords {
		keyword = cleanup(keyword)
		if keyword == "" {
			continue
		}
		if _, isStopWord := stopWords[keyword]; ignoreStopWords && isStopWord {
			continue
		}
		keywords = append(keywords, russian.Stem(keyword, true))
	}

	return keywords
}

func cleanup(s string) string {
	r := strings.Builder{}
	r.Grow(len(s))

	for _, c := range s {
		if unicode.IsLetter(c) {
			r.WriteRune(c)
		}
	}

	return r.String()
}

var stopWords = map[string]struct{}{
	"а":       {},
	"без":     {},
	"более":   {},
	"больше":  {},
	"будет":   {},
	"будто":   {},
	"бы":      {},
	"был":     {},
	"была":    {},
	"были":    {},
	"было":    {},
	"быть":    {},
	"в":       {},
	"вам":     {},
	"вас":     {},
	"вдруг":   {},
	"ведь":    {},
	"во":      {},
	"вот":     {},
	"впрочем": {},
	"все":     {},
	"всегда":  {},
	"всего":   {},
	"всех":    {},
	"всю":     {},
	"вы":      {},
	"где":     {},
	"да":      {},
	"даже":    {},
	"два":     {},
	"для":     {},
	"до":      {},
	"другой":  {},
	"его":     {},
	"ее":      {},
	"ей":      {},
	"ему":     {},
	"если":    {},
	"есть":    {},
	"еще":     {},
	"ж":       {},
	"же":      {},
	"за":      {},
	"зачем":   {},
	"здесь":   {},
	"и":       {},
	"из":      {},
	"или":     {},
	"им":      {},
	"иногда":  {},
	"их":      {},
	"к":       {},
	"как":     {},
	"какая":   {},
	"какой":   {},
	"когда":   {},
	"конечно": {},
	"кто":     {},
	"куда":    {},
	"ли":      {},
	"лучше":   {},
	"между":   {},
	"меня":    {},
	"мне":     {},
	"много":   {},
	"может":   {},
	"можно":   {},
	"мой":     {},
	"моя":     {},
	"мы":      {},
	"на":      {},
	"над":     {},
	"надо":    {},
	"наконец": {},
	"нас":     {},
	"не":      {},
	"него":    {},
	"нее":     {},
	"ней":     {},
	"нельзя":  {},
	"нет":     {},
	"ни":      {},
	"нибудь":  {},
	"никогда": {},
	"ним":     {},
	"них":     {},
	"ничего":  {},
	"но":      {},
	"ну":      {},
	"о":       {},
	"об":      {},
	"один":    {},
	"он":      {},
	"она":     {},
	"они":     {},
	"опять":   {},
	"от":      {},
	"перед":   {},
	"по":      {},
	"под":     {},
	"после":   {},
	"потом":   {},
	"потому":  {},
	"почти":   {},
	"при":     {},
	"про":     {},
	"раз":     {},
	"разве":   {},
	"с":       {},
	"сам":     {},
	"свою":    {},
	"себе":    {},
	"себя":    {},
	"сейчас":  {},
	"со":      {},
	"совсем":  {},
	"так":     {},
	"такой":   {},
	"там":     {},
	"тебя":    {},
	"тем":     {},
	"теперь":  {},
	"то":      {},
	"тогда":   {},
	"того":    {},
	"тоже":    {},
	"только":  {},
	"том":     {},
	"тот":     {},
	"три":     {},
	"тут":     {},
	"ты":      {},
	"у":       {},
	"уж":      {},
	"уже":     {},
	"хорошо":  {},
	"хоть":    {},
	"чего":    {},
	"чем":     {},
	"через":   {},
	"что":     {},
	"чтоб":    {},
	"чтобы":   {},
	"чуть":    {},
	"эти":     {},
	"этого":   {},
	"этой":    {},
	"этом":    {},
	"этот":    {},
	"эту":     {},
	"я":       {},
}
